Catalogs/ДоговорыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДоговорыСтрахования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяРасширенияПрограмм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатыПрикрепления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУдержанияМедицинскогоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержание</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяЧастичноеУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЧастичногоУдержания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрограммыМедицинскогоСтрахования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Программа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммыМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалаВозрастаДляСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалаВозрастаДляРодственников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикУдержаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцУдержанияСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сведение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДанныеЗастрахованных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемаяКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемыеДополнительныеРеквизитыИСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сведение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АдресаРассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасширенияПрограммМедицинскогоСтрахования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасширениеСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РасширенияПрограммМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыСтрахования/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

// Обработка получения полей представления.
// 
// Параметры:
//  Поля - Массив Из Строка
//  СтандартнаяОбработка - Булево
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ДатаНачалаСтрахования");
	Поля.Добавить("ДатаОкончанияСтрахования");
	Поля.Добавить("Наименование");
	Поля.Добавить("Номер");
	
КонецПроцедуры

// Обработка получения представления.
// 
// Параметры:
//  Данные - Структура:
//   * Наименование - Строка
//   * Номер - Строка
//   * ДатаНачалаСтрахования - Дата
//   * ДатаОкончанияСтрахования - Дата
//  Представление - Строка -  Представление
//  СтандартнаяОбработка - Булево -  Стандартная обработка
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон(НСтр("ru = '%1 №%2 от %3, действует до %4'"),
		Данные.Наименование,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер),
		Формат(Данные.ДатаНачалаСтрахования, "ДЛФ=D"),
		Формат(Данные.ДатаОкончанияСтрахования, "ДЛФ=D"));
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция-конструктор для составления параметра к методу ДанныеДоговора.
// 
// Возвращаемое значение:
//  Структура - Параметры получения данных договора:
// * ПрограммыМедицинскогоСтрахования - Булево -
// * ШкалаВозрастаДляСотрудников - Булево -
// * ШкалаВозрастаДляРодственников - Булево -
// * ГрафикУдержаний - Булево -
// * ОтправляемыеДанные - Булево -
// * ОтправляемаяКонтактнаяИнформация - Булево -
// * ОтправляемыеДополнительныеРеквизитыИСведения - Булево -
// * АдресаРассылки - Булево -
Функция ПараметрыПолученияДанныхДоговора() Экспорт
	
	ПараметрыПолучения = Новый Структура();
	ПараметрыПолучения.Вставить("ПрограммыМедицинскогоСтрахования", Ложь);
	ПараметрыПолучения.Вставить("ШкалаВозрастаДляСотрудников", Ложь);
	ПараметрыПолучения.Вставить("ШкалаВозрастаДляРодственников", Ложь);
	ПараметрыПолучения.Вставить("ГрафикУдержаний", Ложь);
	ПараметрыПолучения.Вставить("ОтправляемыеДанные", Ложь);
	ПараметрыПолучения.Вставить("ОтправляемаяКонтактнаяИнформация", Ложь);
	ПараметрыПолучения.Вставить("ОтправляемыеДополнительныеРеквизитыИСведения", Ложь);
	ПараметрыПолучения.Вставить("АдресаРассылки", Ложь);
	
	Возврат ПараметрыПолучения;
	
КонецФункции

// Формирует коллекцию, содержащую данные договора.
//
// Параметры:
//  Договор				 - СправочникСсылка.ДоговорыСтрахования - договор, данные которого нужно получить.
//  ПараметрыПолучения	 - Структура - необязательный, см. ПараметрыПолученияДанныхДоговора.
// 
// Возвращаемое значение:
//  Структура - структура с полями:
// * ДоговорСтрахования - СправочникСсылка.ДоговорыСтрахования
// * СтраховаяКомпания - СправочникСсылка.Контрагенты
// * Номер - Строка
// * Организация - СправочникСсылка.Организации
// * ДатаНачалаСтрахования - Дата
// * ДатаОкончанияСтрахования - Дата
// * ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком - Булево
// * ИспользуютсяРасширенияПрограмм - Булево
// * СдвигДатыПрикрепления - Число
// * ТребуетсяУдержание - Булево
// * СпособУдержания - ПеречислениеСсылка.СпособыУдержанияМедицинскогоСтрахованияСотрудников
// * Удержание - ПланВидовРасчетаСсылка.Удержания
// * УдерживатьЗаСотрудника - Булево
// * УдерживатьЗаРодственников - Булево
// * ПрименяетсяЧастичноеУдержание - Булево
// * ПроцентЧастичногоУдержания - Число
// * ДоговорЗакрыт - Булево
// * ПометкаУдаления - Булево
// * Комментарий - Строка
// * ПрограммыМедицинскогоСтрахования - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ПрограммыМедицинскогоСтрахования
// * ШкалаВозрастаДляСотрудников - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ШкалаВозрастаДляСотрудников
// * ШкалаВозрастаДляРодственников - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ШкалаВозрастаДляРодственников
// * ГрафикУдержаний - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ГрафикУдержаний
// * ОтправляемыеДанные - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ОтправляемыеДанные
// * ОтправляемаяКонтактнаяИнформация - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ОтправляемаяКонтактнаяИнформация
// * ОтправляемыеДополнительныеРеквизитыИСведения - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.ОтправляемыеДополнительныеРеквизитыИСведения
// * АдресаРассылки - ТаблицаЗначений - необязательное поле, наличие определяется значением ПараметрыПолучения.АдресаРассылки
//
Функция ДанныеДоговора(Договор, ПараметрыПолучения = Неопределено) Экспорт
	
	Если ПараметрыПолучения = Неопределено Тогда
		ПараметрыПолучения = ПараметрыПолученияДанныхДоговора();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыСтрахования.Ссылка КАК ДоговорСтрахования,
		|	ДоговорыСтрахования.Владелец КАК СтраховаяКомпания,
		|	ДоговорыСтрахования.Номер,
		|	ДоговорыСтрахования.Организация,
		|	ДоговорыСтрахования.ДатаНачалаСтрахования,
		|	ДоговорыСтрахования.ДатаОкончанияСтрахования,
		|	ДоговорыСтрахования.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком,
		|	ДоговорыСтрахования.ИспользуютсяРасширенияПрограмм,
		|	ДоговорыСтрахования.СдвигДатыПрикрепления,
		|	ДоговорыСтрахования.ТребуетсяУдержание,
		|	ДоговорыСтрахования.СпособУдержания,
		|	ДоговорыСтрахования.Удержание,
		|	ДоговорыСтрахования.УдерживатьЗаСотрудника,
		|	ДоговорыСтрахования.УдерживатьЗаРодственников,
		|	ДоговорыСтрахования.ПрименяетсяЧастичноеУдержание,
		|	ДоговорыСтрахования.ПроцентЧастичногоУдержания,
		|	ДоговорыСтрахования.ДоговорЗакрыт,
		|	ДоговорыСтрахования.ПометкаУдаления,
		|	ДоговорыСтрахования.Комментарий
		|ИЗ
		|	Справочник.ДоговорыСтрахования КАК ДоговорыСтрахования
		|ГДЕ
		|	ДоговорыСтрахования.Ссылка = &Договор";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	
	Если ПараметрыПолучения.ПрограммыМедицинскогоСтрахования Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ПрограммыМедицинскогоСтрахования.Программа");
	КонецЕсли;
	
	Если ПараметрыПолучения.ШкалаВозрастаДляСотрудников Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляСотрудников.ЗначениеДо");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляСотрудников.ЗначениеОт");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляСотрудников.ЗначениеПоказателя");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляСотрудников.ПредставлениеДо");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляСотрудников.ПредставлениеОт");
	КонецЕсли;
	
	Если ПараметрыПолучения.ШкалаВозрастаДляРодственников Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляРодственников.ЗначениеДо");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляРодственников.ЗначениеОт");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляРодственников.ЗначениеПоказателя");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляРодственников.ПредставлениеДо");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ШкалаВозрастаДляРодственников.ПредставлениеОт");
	КонецЕсли;
	
	Если ПараметрыПолучения.ГрафикУдержаний Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ГрафикУдержаний.МесяцУдержания");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ГрафикУдержаний.МесяцУдержанияСтрокой");
	КонецЕсли;
	
	Если ПараметрыПолучения.ОтправляемыеДанные Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДанные.Отправлять");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДанные.Сведение");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДанные.СпособПроверкиЗаполнения");
	КонецЕсли;
	
	Если ПараметрыПолучения.ОтправляемаяКонтактнаяИнформация Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемаяКонтактнаяИнформация.Отправлять");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемаяКонтактнаяИнформация.СпособПроверкиЗаполнения");
	КонецЕсли;
	
	Если ПараметрыПолучения.ОтправляемыеДополнительныеРеквизитыИСведения Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДополнительныеРеквизитыИСведения.Отправлять");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДополнительныеРеквизитыИСведения.Сведение");
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.ОтправляемыеДополнительныеРеквизитыИСведения.СпособПроверкиЗаполнения");
	КонецЕсли;
	
	Если ПараметрыПолучения.АдресаРассылки Тогда
		ВыбираемыеПоля.Добавить("ДоговорыСтрахования.АдресаРассылки.Email");
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	ВыгрузкаДанныхДоговора = Запрос.Выполнить().Выгрузить();
	
	Если ВыгрузкаДанныхДоговора.Количество() = 0 Тогда
		ДанныеДоговора = Неопределено;
	Иначе
		ДанныеДоговора = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыгрузкаДанныхДоговора[0]);
	КонецЕсли;
	
	Возврат ДанныеДоговора;
	
КонецФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
